#### Terraform Plan for DEV Environment 🚀

<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
module.firebase.data.google_project.main: Reading...
data.google_project.branubrain_fs: Reading...
module.cloud_run.google_service_account.cloud_run_sa: Refreshing state... [id=projects/branubrain-fs/serviceAccounts/branubrain-fs-dev@branubrain-fs.iam.gserviceaccount.com]
module.cloud_run.google_project_service.cloud_run_apis["containerregistry.googleapis.com"]: Refreshing state... [id=branubrain-fs/containerregistry.googleapis.com]
module.cloud_run.google_project_service.cloud_run_apis["run.googleapis.com"]: Refreshing state... [id=branubrain-fs/run.googleapis.com]
module.cloud_run.google_project_service.cloud_run_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=branubrain-fs/artifactregistry.googleapis.com]
data.google_client_config.current: Reading...
data.google_client_config.current: Read complete after 0s [id=projects/"branubrain-fs"/regions/"asia-northeast1"/zones/<null>]
module.firebase.data.google_project.main: Read complete after 1s [id=projects/branubrain-fs]
module.firebase.google_project_service.firebase_apis["firebasehosting.googleapis.com"]: Refreshing state... [id=branubrain-fs/firebasehosting.googleapis.com]
module.firebase.google_project_service.firebase_apis["firebase.googleapis.com"]: Refreshing state... [id=branubrain-fs/firebase.googleapis.com]
data.google_project.branubrain_fs: Read complete after 1s [id=projects/branubrain-fs]
module.cloud_run.google_artifact_registry_repository.main: Refreshing state... [id=projects/branubrain-fs/locations/asia-northeast1/repositories/branubrain-fs-dev]
module.firebase.google_firebase_project.main: Refreshing state... [id=projects/branubrain-fs]
module.cloud_run.google_cloud_run_service.main: Refreshing state... [id=locations/asia-northeast1/namespaces/branubrain-fs/services/branubrain-fs-dev]
module.firebase.google_firebase_hosting_site.main: Refreshing state... [id=projects/branubrain-fs/sites/branubrain-fs-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloud_run.google_cloud_run_service.main will be updated in-place
  ~ resource "google_cloud_run_service" "main" {
        id                         = "locations/asia-northeast1/namespaces/branubrain-fs/services/branubrain-fs-dev"
        name                       = "branubrain-fs-dev"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ metadata {
              ~ annotations = {
                  ~ "autoscaling.knative.dev/maxScale"         = "3" -> "10"
                  - "run.googleapis.com/client-name"           = "gcloud" -> null
                  - "run.googleapis.com/client-version"        = "524.0.0" -> null
                  - "run.googleapis.com/startup-cpu-boost"     = "false" -> null
                    # (1 unchanged element hidden)
                }
                # (2 unchanged attributes hidden)
            }
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "asia-northeast1-docker.pkg.dev/branubrain-fs/branubrain-fs-dev/backend-dev:3565237378c7c5ed8631f4ca77d6ec54fd651e3d" -> "asia-northeast1-docker.pkg.dev/branubrain-fs/branubrain-fs-dev/backend-dev"
                    name    = "main-1"
                    # (2 unchanged attributes hidden)

                  - env {
                      - name  = "ENVIRONMENT" -> null
                      - value = "development" -> null
                    }

                  ~ resources {
                      ~ limits   = {
                          ~ "cpu"    = "1" -> "2000m"
                          ~ "memory" = "512Mi" -> "1Gi"
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (2 unchanged blocks hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.storage.google_storage_bucket.main will be created
  + resource "google_storage_bucket" "main" {
      + effective_labels            = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "branubrain-fs-dev-storage"
      + project                     = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Target: `dev` environment | Pusher: @shiroishi761*